"Crystal Palace 1-2 Tottenham Hotspur: Heung-min Son scores again as Ange Postecoglou's Spurs stay top of the league - EurosportWatchResultsUCI Track CLFootballSnookerAll SportsSign InSign InHomeWatchResultsMost Popular SportsUCI Track CLUCI Track CL HomeFixtures - ResultsCalendarMen's standingsWomen's standingsFootballFootball HomeFixtures - ResultsPremier LeagueChampions LeagueEuropa LeagueAll CompetitionsAll leaguesSnookerSnooker HomeVideoResultsWorld ChampionshipUK ChampionshipMastersMajor eventsTennisTennis HomeCalendar - ResultsLaver CupAustralian OpenRoland-GarrosWimbledonUS OpenAll CompetitionsParis 2024Mountain BikeMountain Bike HomeResultsRankingsTeamsCyclingCycling HomeResultsRace calendarTour de FranceVuelta a EspañaGiro d'ItaliaDare to DreamAll CompetitionsAll SportsShow AllAlpine SkiingAlpine Skiing HomeFixtures - ResultsCalendarMen's standingsWomen's standingsWorld ChampionshipAthleticsAthletics HomeFixtures - ResultsDiamond LeagueWorld ChampionshipsWorld Indoor ChampionshipsTokyo 2020All CompetitionsBSBBSB HomeFixtures - ResultsCalendarStandingsBiathlonBiathlon HomeFixtures - ResultsCalendarMen's standingsWomen's standingsWorld ChampionshipsBoxingCricketCross-Country SkiingCross-Country Skiing HomeFixtures - ResultsCalendarMen's standingsWomen's standingsWorld ChampionshipCyclingCycling HomeResultsRace calendarTour de FranceVuelta a EspañaGiro d'ItaliaDare to DreamAll CompetitionsCycling - TrackDartsDarts HomeFixtures - ResultsEquestrianEquestrian HomeFixtures - ResultsTokyo 2020F1F1 HomeResultsRace calendarStandingsFigure SkatingFigure Skating HomeFixtures - ResultsCalendarWorld ChampionshipsFootballFootball HomeFixtures - ResultsPremier LeagueChampions LeagueEuropa LeagueAll CompetitionsAll leaguesFormula EFormula E HomeFixtures - ResultsCalendarRankingsFanboostGolfGolf HomeCalendar - resultsPGA TourDP World TourRyder CupAll CompetitionsJudoJudo HomeFixtures - ResultsTokyo 2020MotoGPMotoGP HomeCalendarStandingsMotorsportsMotorsports HomeCalendar - ResultsF1MotoGPSpeedway GPSuperbikesAll SportsMountain BikeMountain Bike HomeResultsRankingsTeamsOlympicsOlympics HomeVideoOlympic Channel Tokyo 2020Paris 2024RugbyRugby HomeFixtures - ResultsWorld CupRugby World Cup predictorPremiershipChampions CupChallenge CupAll LeaguesSki JumpingSki Jumping HomeFixtures - ResultsCalendarStandingsWomen's standingsSnookerSnooker HomeVideoResultsWorld ChampionshipUK ChampionshipMastersMajor eventsSpeedway GPSpeedway GP HomeFixtures - ResultsCalendarStandingsSuperbikesSuperbikes HomeFixtures - ResultsCalendarTableTennisTennis HomeCalendar - ResultsLaver CupAustralian OpenRoland-GarrosWimbledonUS OpenAll CompetitionsThe Ocean RaceThe Ocean Race HomeCalendar - ResultsStandingsTriathlonTriathlon HomeFixtures - ResultsPTO TourUCI Track CLUCI Track CL HomeFixtures - ResultsCalendarMen's standingsWomen's standingsUFCWECWEC HomeFixtures - ResultsCalendarStandingsHours of Le MansWinter SportsWinter Sports HomeCalendar - ResultsAll SportsFootballPremier LeagueFixtures - ResultsTableTop scorersPrevious winnersAdvertisementAdFootballPremier LeagueCrystal Palace 1-2 Tottenham Hotspur: Heung-min Son scores again as Ange Postecoglou's Spurs stay top of the leagueByPaul HassallUpdated 27/10/2023 at 22:19 GMTHeung-min Son was on the scoresheet again as Tottenham Hotspur remained unbeaten and top of the Premier League table thanks to a 2-1 win away at Crystal Palace. Son scored after an own-goal from Joel Ward had given the away side the lead. Spurs are guaranteed to be top despite what happens for the rest of the weekend as they have a cushion of five points over their rivals.LONDON, ENGLAND - OCTOBER 27: Son Heung-Min of Tottenham Hotspur celebrates with teammates after scoring the team's second goal during the Premier League match between Crystal Palace and Tottenham Hotspur at Selhurst Park on October 27, 2023 in London, EnImage credit: Getty ImagesHeung-Min Son and James Maddison starred as Tottenham moved five points clear at the top of the Premier League with a 2-1 victory that condemned Crystal Palace boss Roy Hodgson to defeat on his 500th match in charge of English clubs in all competitions.  Ange Postecoglou’s table-toppers took their time to hit their stride and it was The Eagles who posed the greater threat on the counter attack with Jordan Ayew and Odsonne Edouard both going close. Spurs had 73% of the possession but struggled to carve out any clear-cut openings as they failed to register a shot on target in the first half for the first time this season. Premier LeagueSilva signs new three-year contract with Fulham24/10/2023 at 16:23Patience was the key and The Lilywhites eventually broke the deadlock in fortuitous fashion when Maddison’s cross-shot was diverted into his own net by Joel Ward on 53 minutes. Palace lacked the cutting edge to make life uncomfortable for the away side and Spurs doubled their advantage past the hour when Son tucked in following lovely build-up from Maddison and substitute Brennan Johnson down the left. Ayew struck a brilliant volley into the far corner deep into stoppage time to give The Eagles brief hope, but it wasn’t enough to deny The Lilywhites the three points. The result means Spurs now have eight wins and 26 points from 10 games played with a five-point cushion over second-placed Manchester City ahead of the rest of the weekend’s action. Palace are 11th on 12 points and have won just once in their last seven matches in all competitions.    Tottenham will aim to maintain their unbeaten start to the league season at home to Chelsea next Monday. Palace visit Burnley next Saturday.  Premier League tablePremier League fixtures / resultsPremier League top scorersTalking Point - Spurs stay patient to maintain best Premier League start to a campaign This was far from Tottenham’s best display of the season, but once again they found a way to secure a win that moves them five points clear in the top-flight for the first time since the 1960-61 campaign, when they went on to win the Double.The feel-good factor under Ange looks like it’s here to stay and there were plenty of positive to take from this victory at Selhurst Park.Son took his tally to eight for the season as he thrives in a centre-forward role while new boys Maddison and Micky van de Ven continue to shine.There was even the good news of a late appearance off the bench from Rodrigo Bentancur, who put the seal on the night with his first outing since returning from a serious, long-term ACL injury.LONDON, ENGLAND - OCTOBER 27: James Maddison (L), Cristian Romero (C) and Son Heung-Min of Tottenham Hotspur celebrate with teammates after Joel Ward of Crystal Palace (Not Pictured) scored an own goal during the Premier League match between Crystal PalacImage credit: Getty ImagesPlayer of the match - James Maddison (Tottenham)Once again the midfielder was the chief creative force and it was no surprise his cross-shot led to the opener. The former Leicester man also had a hand in the second goal and continues to look like one of the signings of the summer.Player RatingsPALACE: Johnstone 7, Ward 6, Guehi 7, Andersen 7, Mitchell 6, Ayew 7, Lerma 7, Doucoure 7, Hughes 6, Schlupp 6, Edouard 6. Subs: Rak-Sakyi 6, Clyne 6, Ahamada 6, Mateta 6, Franca 6.SPURS: Vicario 8, Porro 6, Romero 7, Van de Ven 8, Davies 6, Bissouma 7, Sarr 7, Kulusevski 6, Maddison 8*, Son 7, Richarlison 6. Subs: Emerson 6, Hojbjerg 6, Johnson 7, Gil n/a, Bentancur n/a.Matchcast: Full match stats and commentary Match Highlights 07’ – CRYSTAL PALACE CHANCE! Hughes leads a break down the middle. He can't outpace Van de Ven but does feed Ayew to his right. The forward gets the ball out of his feet and lashes in a 20-yard shot that Vicario beats to safety.08’ – CRYSTAL PALACE CHANCE! Vicario is again called into action, producing an even better save to push away Édouard's low strike from just inside the box.53’ – GOAL! – Crystal Palace 0-1 Tottenham. Sarr overlaps down the right and cuts it back for Maddison, who lashes a volleyed cross-shot into the danger zone for Joel Ward to inadvertently crash the ball into his own net!56’ – CRYSTAL PALACE CHANCE!  Guehi is left free to meet a right-wing corner but glances it wide of target.66’ – GOAL! – Crystal Palace 0-2 Tottenham. Son tucks into the corner from close range after lovely combination from Maddison and Johnson down the left.90+5’ – GOAL! – Crystal Palace 1-2 Tottenham. Ayew chests down a ball from the left and volleys a brilliant strike into the far corner from the left side of the box.Key statSpurs are five points clear at the top of the Premier League – their biggest lead on second place in the top-flight since the final day of the 1960-61 campaign (eight points), when they last won the title.- - -TNT Sports presents the premium live sports rights previously carried by BT Sport including the Premier League, UEFA Champions League, UEFA Europa League, UEFA Conference League, Gallagher Premiership Rugby, Heineken Champions Cup, EPCR Challenge Cup, MotoGP, Cricket, UFC, Boxing and WWE. The streaming home for TNT Sports in the UK is discovery+, where fans can enjoy a subscription that includes TNT Sports, Eurosport and entertainment in one destination. You can also watch TNT Sports through BT, EE, Sky, and Virgin Media.Premier League'We took liberties' - Postecoglou unhappy with 'wasteful' Spurs despite win23/10/2023 at 22:32Premier LeagueSon and Maddison both on target as Spurs go back top23/10/2023 at 22:02Premier LeagueNewcastle cruise to victory over Palace as Tonali appears from the bench21/10/2023 at 18:51Join 3M+ users on appStay up to date with the latest news, results and live sportsDownloadScan meRelated TopicsFootballPremier LeagueTottenham HotspurCrystal PalaceShare this articleRelated MatchesCrystal Palace12Tottenham HotspurAdvertisementAdAdvertisementAdHow was your experience today?Change version:International (English)International (English)Internacional (Español)DanmarkDeutschlandDutchEspañaFranceItaliaMagyarországNorgePolska TVN24RomâniaTürkiyeUnited KingdomHelp centreMoreAbout UsAbout EurosportMobile AppsLegal InformationTerms of UsePrivacy PolicyLegal InformationCookies & Tracking Technologies NoticeEurosport Pass InformationModern Slavery StatementCookies and Ad Choices© 2023 Eurosport, a Warner Bros. Discovery company. All rights reserved.\n\n"